<?php

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//  アップローダーでゲソ！
//    エラーメッセージ定義ファイルじゃなイカ？
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// ----- エラーメッセージ関連 -----------------------------------------------------------

// タイトル画面のテンプレートファイルが行方不明
$error_template_title_not_found = "HTML テンプレートファイルが見つかりません。アップローダーを表示できません。";

// HTML フッター部分のテンプレートファイルが行方不明
$error_template_footer_not_found = "HTML フッター用テンプレートファイルが見つかりません。";

// タイトル画面のアップロード用フォーム置き換えタグが行方不明
$error_template_upform_not_found = "アップロード用フォームのテンプレートファイルが見つかりません。";
$error_title_upform_not_found = "アップロード用フォームを表示するタグが見つかりません。";

// タイトル画面のページリスト置き換えタグが行方不明
$error_title_pglist_not_found = "ページリストを表示するタグが見つかりません。";

// ログファイルが行方不明
$error_log_not_found = "ログファイルが見つかりません。新規作成します。";

// ログファイルが作成できない
$error_log_cannot_write = "ログファイルが作成できないか、書込みができません。";

// タイトル画面のファイル一覧置き換えタグが行方不明
$error_template_flist_not_found = "ファイル一覧を表示するテンプレートファイルが見つかりません。";
$error_title_flist_not_found = "ファイル一覧を表示するタグが見つかりません。";

// アップロード処理で、ファイルがアップロードされていない
$error_up_file_no_uploaded = "ファイルがアップロードされていません。";

// アップロード処理で、許可されていないファイル拡張子
$error_up_file_not_arrowed = "アップロード可能なファイル形式ではありません。";

// アップロード処理で、ファイルをアップロードディレクトリに移動できなかった
$error_up_file_failed = "アップロードに失敗しました。";

// ファイル削除処理で、ファイルが見つからない
$error_del_file_not_found = "指定のファイルが見つかりません。";

// ファイル削除処理で、パスワード不一致
$error_del_wrong_password = "パスワードが一致しません。";

// ファイル削除処理に失敗
$error_del_fail = "削除処理に失敗しました。";

